hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/inc/hc32m120_icg.h
/**
 *******************************************************************************
 * @defgroup ICG_Registers_Configuration ICG Registers Configuration
 * @{
 *******************************************************************************
 */
/* ICG0 register value */
#define ICG0_REGISTER_CONSTANT                  ((uint32_t)(ICG0_SWDT_REG_CONFIG | \
                                                            ICG0_HRC_REG_CONFIG  | \
                                                            ICG0_NMI_REG_CONFIG))
/* ICG1 register value */
#define ICG1_REGISTER_CONSTANT                  ((uint32_t)ICG1_LVD_REG_CONFIG)
/* ICG2~7 register reserved value */
#define ICG2_REGISTER_CONSTANT                  ((uint32_t)0xFFFFFFFFul)
#define ICG3_REGISTER_CONSTANT                  ((uint32_t)0xFFFFFFFFul)
#define ICG4_REGISTER_CONSTANT                  ((uint32_t)0xFFFFFFFFul)
#define ICG5_REGISTER_CONSTANT                  ((uint32_t)0xFFFFFFFFul)
#define ICG6_REGISTER_CONSTANT                  ((uint32_t)0xFFFFFFFFul)

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/

#endif /* DDL_ICG_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __HC32M120_ICG_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
